Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: །རིན་ཆེན་པདྨའི་ཕུང་བཞིན་མཚན་རྣམས་མཛེས།
en: You are beautified by signs like a mass of precious lotuses.

source: །དཔེར་ན་གདུགས་ཤར་ནམ་མཁའ་སྣང་བགྱིད་བཞིན། །ཁ་དོག་དཀར་གསལ་གསེར་གྱི་མདོག་ཀྱང་གནོན།
en: You are like the sun shining in the sky, A bright white light that outshines the color of gold. “

source: །གསེར་གྱི་རི་བཞིན་འོད་ཀྱིས་གསལ་མཛད་པས། །ཞིང་ནི་བརྒྱ་སྟོང་མང་པོ་ཀུན་དུ་ཁྱབ། །སེམས་ཅན་སྡུག་བསྔལ་ཚད་མེད་ཞི་མཛད་ནས། །བདེ་བ་དམ་པ་མཐའ་ཡས་སྩལ་བར་མཛད།
en: You are like a mountain of gold, shining with a light That spreads throughout many hundreds of thousands of realms, Extinguishing the infinite sufferings of beings And bestowing endless, sublime happiness. “

source: །མཚན་རྣམས་ཕུན་ཚོགས་རྣམ་དག་རབ་མཛེས་པས། །སེམས་ཅན་ལྟ་མོས་སྐྱོ་བ་ཡོང་མ་མཆིས།
en: You have the perfect, pure, beautiful physical signs So that beings never tire of gazing upon you.

source: །དབུ་སྐྲ་རབ་མཉེན་ཁ་དོག་མཐོན་མཐིང་གནས། །བུང་བ་ནག་པོ་མེ་ཏོག་བསྡུས་པ་འདྲ།
en: Your hair is perfectly soft and deep blue in color And resembles black bees massed upon a flower. “

source: །དགྱེས་དང་བཏང་སྙོམས་ཆེན་པོ་དག་པས་བརྒྱན།
en: You are adorned by delight and equanimity.

source: །བྱམས་དང་ཐུགས་རྗེ་ཆེན་པོ་ཕུན་སུམ་ཚོགས།
en: You have a perfection of great love and compassion.

source: །མཚན་དང་དཔེ་བྱད་དམ་པ་རབ་མཛེས་པ། །བྱང་ཆུབ་ཡན་ལག་ཆོས་ལས་གྲུབ་པ་ལགས།
en: You are beautified by the signs and features of a great being, Attained through the qualities of the aspects of enlightenment. “

source: །བཅོམ་ལྡན་བསོད་ནམས་ཕན་པ་མང་བཏང་བས། །དེ་དག་རྟག་ཏུ་བདེ་བ་ཆེན་པོ་འཐོབ།
en: Bhagavat, you bring beings great merit and benefit, So that they always attain great happiness.

source: །ཡོན་ཏན་རྣམ་པ་སྣ་ཚོགས་རབ་བརྒྱན་པས། །འོད་ཀྱི་ཞིང་ནི་བརྒྱ་སྟོང་སྣང་བར་མཛད།
en: You are adorned by the various kinds of qualities, And your light illuminates a hundred thousand realms. “

source: །བཅོམ་ལྡན་འོད་ཟེར་ཤིན་ཏུ་རྫོགས་པས་ན། །དཔེར་ན་གདུགས་ཀྱིས་ནམ་མཁའ་ཀུན་ཁྱབ་འདྲ།
en: Bhagavat, you have completely perfect light rays That are like the sun that fills the sky with light.

source: །བཅོམ་ལྡན་རི་རབ་བཞིན་དུ་ཡོན་ཏན་ལྡན། །ཕྱོགས་བཅུ་ཀུན་དུ་ཁྱབ་པར་སྟོན་པ་མཛད།
en: Bhagavat, you are like Mount Sumeru, endowed with qualities, And you manifest everywhere in all ten directions. “

source: །བཅོམ་ལྡན་གསེར་ཞལ་དམ་པ་རབ་ཏུ་མཛེས།
en: Bhagavat, your sublime, golden mouth is perfectly beautiful.

source: །ཚེམས་དཀར་གཏམས་པ་དུང་གི་ཁ་དོག་འདྲ།
en: Your full white teeth are the color of conches.

source: །བཅོམ་ལྡན་ཞལ་མཛེས་དཔེ་ཟླ་ཡོང་མ་མཆིས། །སྨིན་མཚམས་བ་སྤུ་རྟག་པར་གཡས་སུ་འཁྱིལ།
en: Bhagavat, the moon does not compare to the beauty of your face, And between your eyebrows there are hairs always curled to the right. “

source: །འོད་མཉེན་དཀར་གསལ་ཆུ་ཤེལ་དག་དང་མཚུངས། །དཔེར་ན་ཟླ་ཉ་ནམ་མཁའི་ཁམས་གནས་འདྲ།
en: They are luminous, soft, bright, and white, resembling crystal, And like the full moon resting in the element of space.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་ལ་བཀའ་སྩལ་པ། །ཁྱོད་ཀྱིས་འདི་ལྟར་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་བསྔགས་པ་བརྗོད་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་ཡིན་པས་ཐམས་ཅད་ལ་ཕན་འདོགས་པར་འགྱུར་ཞིང་།
en: Then the Bhagavat said to the bodhisattva Ruciraketu, “This praise you have made of the qualities of a tathāgata is inconceivable and will be beneficial for all.

source: གང་དག་ཁོང་དུ་མ་ཆུད་པ་དེ་དག་ཀྱང་རྗེས་སུ་མཐུན་པར་རྣལ་འབྱོར་སྒོམ་པ་ལ་སློབ་པར་འགྱུར་རོ།
en: Whoever learns it will be learning to meditate on the practice that accords with it.”

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གིས་བསྔགས་པ་བརྗོད་པའི་ལེའུ་སྟེ་ཉི་ཤུ་བརྒྱད་པའོ།། །།
en: This concludes “The Praise by the Bodhisattva Ruciraketu,” the twenty-eighth chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བྱང་ཆུབ་ཀྱི་ཤིང་གི་ལྷ་མོས་ཀྱང་ཚིགས་སུ་བཅད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་པ། །བཅོམ་ལྡན་རྣམ་དག་བློ་ལ་གུས་ཕྱག་འཚལ། །རྣམ་དག་ཆོས་གཉེར་བློ་ལ་གུས་ཕྱག་འཚལ།
en: Chapter 29: The Praise by the Goddess of the Bodhi Tree Then the goddess of the Bodhi tree praised the Bhagavat with these verses: “I reverently pay homage to the Buddha who has pure knowledge.

source: །ཡང་དག་ཆོས་གཉེར་བློ་ལ་གུས་ཕྱག་འཚལ།
en: I pay homage to the one with the knowledge that preserves the pure Dharma.

source: །ཆོས་མིན་སྤོང་བའི་བློ་ལ་གུས་ཕྱག་འཚལ།
en: I pay homage to the one with the knowledge that rejects what is not the Dharma.

source: །རྣམ་རྟོག་མི་མངའ་བློ་ལ་གུས་ཕྱག་འཚལ།
en: I pay homage to the one with the knowledge that is not possessed of concepts. “

source: །ཀྱེ་མ་ངོ་མཚར་བཅོམ་ལྡན་མཐའ་ཡས་སྤྱོད།
en: Oh! The wonderful Buddha has infinite activity!

source: །ཀྱེ་མ་མཐོང་དཀའ་ཨུ་དུམ་བཱ་ར་འདྲ།
en: Oh! He is as difficult to see as a fig tree flower!

source: །ཀྱེ་མ་ངོ་མཚར་རྒྱ་མཚོའི་རི་རྒྱལ་འདྲ།
en: Oh! He is as wonderful as the ocean and the king of mountains! Oh!

source: །ཀྱེ་མ་ངོ་མཚར་བདེ་གཤེགས་འོད་ཚད་མེད།
en: The wonderful Tathāgata’s light is beyond measure! “Oh!

source: །ཀྱེ་མ་ངོ་མཚར་ཁ་བསྒྱུར་སྨོན་ལམ་ཆེ།
en: Wonderful leader, with great prayers!

source: །ཀྱེ་མ་ངོ་མཚར་ཤཱཀ་རིགས་ཉི་མ་འདིས། །འདི་འདྲའི་མདོ་སྡེ་དཀོན་མཆོག་བཀས་བཤད་ནས། །བརྩེ་བས་སྐྱེ་དགུ་རྣམས་ལ་ཕན་འདོགས་མཛད།
en: Oh! This wonderful sun of the Śākya clan Has taught such a supremely rare sūtra as this, And thus with his compassion he benefits beings. “

source: །ཐུབ་པ་རབ་དབེན་དབང་པོ་མཉམ་འཇོག་པས།
en: The Muni, lord of complete detachment, rests in equanimity.

source: །རབ་ཞི་མྱ་ངན་འདས་པའི་གྲོང་ཁྱེར་གཤེགས།
en: He has gone into the city of nirvāṇa, of perfect peace.

source: །རབ་དབེན་གཟུངས་ཀྱི་སྒོ་ལ་བཞུགས་པས་ན། །རབ་དབེན་སྤྱོད་ཡུལ་ཟབ་མོ་དག་ཀྱང་མཁྱེན།
en: He has entered the gateway of the retention of complete detachment, And he knows the profound fields of activity of complete detachment. “

source: །རྐང་གཉིས་གཙོ་བོ་རབ་དབེན་བཞུགས་པས་ན། །ཉན་ཐོས་སློབ་མ་ལུས་ཀྱང་དེ་བཞིན་སྟོང་། །ཆོས་རྣམས་ཐམས་ཅད་ངོ་བོ་མ་མཆིས་པས། །སེམས་ཅན་ཐམས་ཅད་ཀྱང་ནི་སྟོང་ཞིང་དབེན།
en: As the lord of humans remains in complete detachment, In the same way, the bodies of his śrāvaka disciples are empty, All phenomena are devoid of an essence, And all beings also are empty and detached. “

source: །བདག་ནི་རྟག་ཏུ་བཅོམ་ལྡན་དྲན་པར་བགྱིད།
en: I am constantly thinking of the Bhagavat.

source: །བདག་ནི་རྟག་ཏུ་བཅོམ་ལྡན་མཐོང་བར་མོས།
en: I am constantly hoping to see the Bhagavat.

source: །བདག་ནི་རྟག་ཏུ་གུས་སེམས་བསྐྱེད་པས་ན། །རྟག་པར་དེ་བཞིན་གཤེགས་པའི་གདུགས་དང་མཇལ།
en: Because I am constantly in veneration of him, I am constantly meeting the sun that is the Tathāgata. “

source: །བདག་ནི་རྟག་ཏུ་བཅོམ་ལྡན་ཕྱག་བགྱིས་ནས།
en: I constantly pay homage to the Bhagavat.

source: །རྟག་པར་ཞལ་ལྟ་སེམས་ཀྱིས་མི་སྤོང་སྨོན།
en: I constantly pray in my mind to not lose sight of his face.

source: །རབ་ཏུ་གདུང་སེམས་བར་ཆད་མ་མཆིས་པར། །རྟག་པར་རིམ་གྲོ་བགྱིས་ཀྱང་སྐྱོ་མི་བགྱིད།
en: Though with a longing mind, I constantly serve him, Without any impediments I will never grow weary of it. “

source: །བཅོམ་ལྡན་ཐུགས་རྗེའི་ཐུགས་ནི་རབ་བསྐྱེད་ནས། །མདངས་ལྡན་ཞལ་ནི་བདག་གིས་རྟག་མཐོང་མཛོད།
en: Bhagavat, have compassion in your mind for me And enable me to constantly see your bright face.

source: །བཅོམ་ལྡན་ཉན་ཐོས་དགེ་འདུན་རྣམ་དག་པས། །རྟག་པར་ལྷ་མི་དག་ནི་བསྒྲལ་བར་སྨོན།
en: Bhagavat, the pure saṅgha of your disciples Constantly aspire to liberate devas and humans. “

source: །སྐུ་ནི་རང་བཞིན་རྣམ་དག་ནམ་མཁའ་འདྲ། །སྒྱུ་མ་སྨིག་རྒྱུ་ཆབ་ཀྱི་ཟླ་བ་མཚུངས། །བདུད་རྩི་མྱ་ངན་འདས་པའི་ཆོས་བཤད་ནས།
en: Your body has a pure nature that is like space, Like an illusion, a mirage, or the moon on water.

source: །ཡོན་ཏན་ཕུང་པོ་ཐམས་ཅད་སྐྱེད་པར་སྨོན།
en: When you teach the amṛta of the Dharma, We aspire to develop the entire accumulation of qualities. “

source: །བཅོམ་ལྡན་རྣམ་དག་སྤྱོད་ཡུལ་བྱམས་པ་དང་། །ཐུགས་རྗེ་ཡང་དག་སྤྱོད་ཡུལ་བསམ་མི་ཁྱབ།
en: Bhagavat, your pure field of activity of love And compassion is an inconceivable field of activity.

source: །ཉན་ཐོས་རང་རྒྱལ་གཞལ་བར་མི་འགྱུར་ཞིང་།
en: The śrāvakas and pratyekabuddhas cannot conceive of it.

source: །དྲང་སྲོང་བྱང་ཆུབ་སེམས་དཔས་དཔོག་མི་འགྱུར།
en: The ṛṣis and bodhisattvas cannot fathom it. “

source: །དེ་བཞིན་གཤེགས་པས་བདག་ལ་ཐུགས་བརྩེ་ནས། །ཐུགས་རྗེ་ཆེན་པོའི་སྐུ་ནི་རྟག་མཐོང་སྨོན།
en: I pray that the Tathāgata will have kindness for me So that I constantly see his body of great compassion.

source: །ལས་གསུམ་ངལ་མེད་བྱམས་གཙོ་མཆོད་ནས་ནི། །མྱུར་དུ་ངེས་འབྱུང་ཡང་དག་མཐའ་ཕྱོགས་སྨོན།
en: I pray that, having made offerings tirelessly through the three activities To the lord of love, I will quickly reach the conclusion of forsaking saṃsāra.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བསྔགས་པ་བརྗོད་པ་གསན་པ་དང་། །ཚངས་པའི་དབྱངས་ཀྱིས་ཤིང་གི་ལྷ་མོ་ལ་བཀའ་སྩལ་པ། །རིགས་ཀྱི་ལྷ་མོ་ཁྱོད་ཀྱིས་ངའི་ཡང་དག་པའི་མི་བརྫུན་པའི་ཆོས་ཀྱི་སྐུ་རྣམ་པར་དག་པའི་བསྔགས་པ་བརྗོད་ནས་བདག་དང་གཞན་ལ་ཕན་གདག་པའི་ཕྱིར་མཚན་མཆོག་གྱ་ནོམ་པ་ཡང་དག་པར་བསྒྲགས་པ་ལེགས་སོ་ལེགས་སོ།
en: Then the Bhagavat, having listened to those words of praise, said with the voice of Brahmā to the tree goddess, “Noble goddess, that you have praised my pure, truly genuine Dharma body, and in order to benefit yourself and others have recited the wonderful supreme qualities, is excellent, excellent!

source: །བསོད་ནམས་འདིས་ཁྱོད་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་སེམས་ཅན་ཐམས་ཅད་མཚུངས་པར་རྣལ་འབྱོར་བསྒོམ་པར་འགྱུར་ལ།
en: Through this merit, you will quickly attain the highest, most complete enlightenment of perfect buddhahood, and all beings will meditate and practice in the same way.

source: གང་གིས་ཐོས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པའི་བདུད་རྩིའི་ཆོས་ཀྱི་སྒོར་འཇུག་པར་འགྱུར་རོ།
en: Everyone who hears you will enter the gateway of the Dharma of the highest amṛta.”

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་བྱང་ཆུབ་ཀྱི་ཤིང་གི་ལྷ་མོས་བསྔགས་པ་བརྗོད་པའི་ལེའུ་སྟེ་ཉི་ཤུ་དགུ་པའོ།། །།དེ་ནས་ལྷ་མོ་སྤོབས་པ་ཆེན་མོ་སྟན་ལས་ལངས་ཏེ་གུས་པས་ཐལ་མོ་སྦྱར་ནས་ཡང་དག་པའི་ཚིག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་པ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་སྐུ་ཡང་དག་པར་གསེར་གྱི་ཁ་དོག་དང་ལྡན་པ། མགུར་དུང་གི་དབྱིབས་དང་འདྲ་བ། ཞལ་ཟླ་བ་ཉ་བ་ལྟ་བུ་སྤྱན་པདྨ་སྔོན་པོ་དང་མཚུངས་པ། སྒྲོས་དམར་ཞིང་བཟང་བ། ཆུ་ཤེལ་གྱི་ཁ་དོག་དང་འདྲ་བ། ཤངས་ཀྱི་དབྱིབས་མཐོ་ཞིང་དྲང་བས་གསེར་གྱི་གར་བུ་བཅད་པ་ལྟ་བུར་གྱུར་པ། ཚེམས་དཀར་ཞིང་ཐགས་བཟང་བ་མེ་ཏོག་ཀུ་མུ་ད་དང་མཚུངས་པ། འོད་ཀྱིས་ཀུན་དུ་སྣང་བར་མཛད་པས་ཉི་མ་བརྒྱ་སྟོང་ལྟ་བུར་གྱུར་པ།
en: This concludes “The Praise by the Goddess of the Bodhi Tree,” the twenty-ninth chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: འོད་ཀྱི་ཁ་དོག་ཀུན་དུ་ཁྱབ་པས་འཛམ་བུའི་གསེར་དང་འདྲ་བ། ཚིག་གསུང་བ་ལ་ནོར་ཞིང་འཁྲུལ་པ་མི་མངའ་བ། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ཡང་དག་པར་བསྟན་ནས། བྱང་ཆུབ་རྣམ་པ་གསུམ་གྱི་ལམ་ཡང་དག་པར་འབྱེད་པ། ཐུགས་རྟག་ཏུ་རྣམ་པར་དག་ཅིང་ཐུགས་ཀྱི་མོས་པ་ཡང་དེ་བཞིན་དུ་གྱུར་པ། བཅོམ་ལྡན་འདས་བཞུགས་པའི་གནས་དང་སྤྱོད་ཡུལ་རྣམས་རྟག་པར་རྣམ་པར་དག་པར་གྱུར་པ། སྤྱོད་ལམ་མ་ལགས་པ་སྤངས་པས་གཤེགས་ཤིང་བཞུགས་པ་དག་ལ་འཁྲུལ་པ་མི་མངའ་བ། ལོ་དྲུག་དཀའ་བ་མཛད་ནས་ཆོས་ཀྱི་འཁོར་ལོ་ལན་གསུམ་དུ་བསྐོར་བ།
en: Chapter 30: The Praise by the Great Goddess Sarasvatī Then the great goddess Sarasvatī rose from her seat and with veneration placed her palms together and praised the Bhagavat with these pure words: “I pay homage to the tathāgata arhat samyaksambuddha Śākyamuni, who has a pure body the color of gold—his throat has the shape of a conch; his face is like a full moon and his eyes are like blue lotuses; his lips are red and beautiful, like the color of a bimba; his nose is prominent and straight and like a carved piece of gold; his teeth are white, without gaps, and like white water lilies; he shines with light like a hundred thousand suns; his bright colors are vivid like the gold of Jambudvīpa; the words he speaks are free of mistakes and errors; he teaches the three gateways of liberation, opening the paths to the three enlightenments; his mind is always pure and so is his aspiration; the places where the Bhagavat resides and his field of activity are always pure; he has forsaken that which should not be the conduct, so that there is no error whether he is moving or stationary; he undertook asceticism for six years and then turned the Dharma wheel three times; he liberated beings who are suffering, bringing them over to the other shore; the signs of a great being on his body are complete, like a banyan tree; through his meditation on the six perfections, his three kinds of activity are faultless; he has omniscience and therefore accomplishes perfect benefit for himself and others; whatever it is that he says, it will always benefit beings, so that he never says anything that is purposeless; he was a great lion from within the Śākya clan and therefore is unshakable and heroic; and he has the perfection of the eight liberations. “

source: སྡུག་བསྔལ་བའི་སེམས་ཅན་ཡོངས་སུ་བཟླས་ནས་ཕ་རོལ་གྱི་འགྲམ་དུ་ཕྱིན་པར་མཛད་པ། སྐུའི་མཚན་ཡོངས་སུ་རྫོགས་པ་ནྱ་གྲོ་དྷའི་ལྗོན་ཤིང་ལྟ་བུར་གྱུར་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་བསྒོམས་པས་ཕྲིན་ལས་རྣམ་པ་གསུམ་ལ་སྐྱོན་མི་མངའ་བ། ཐམས་ཅད་མཁྱེན་པ་དང་ལྡན་པས་བདག་དང་གཞན་གྱི་དོན་ཕུན་སུམ་ཚོགས་པར་མཛད་པ། གང་ཅི་གསུང་ཡང་རུང་སྟེ།
en: Today, simply according to my own experience, I have made this praise of just a few aspects of the qualities of the Tathāgata, like the water that a fly would obtain from a great ocean.

source: རྟག་པར་སེམས་ཅན་གྱི་དོན་དུ་འགྱུར་བར་མཛད་པས་དོན་མ་མཆིས་པར་མི་གསུང་བ། ཤཱཀྱའི་རིགས་ཀྱི་ནང་ནས་སེང་གེ་ཆེན་པོར་གྱུར་པས་རབ་ཏུ་བརྟན་ཞིང་དཔའ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ཕུན་སུམ་ཚོགས་པར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ། །དེང་བདག་གི་ཉམས་ཀྱིས་ཇི་ཙམ་ལྕོགས་པའི་རྗེས་སུ་དེ་བཞིན་ཤེགས་པའི་ཡོན་ཏན་གྱི་ཕྱོགས་ལས་ཅུང་ཟད་ཙམ་ཞིག་བསྔགས་པ་བརྗོད་པ་ནི་འདི་ལྟ་སྟེ། དཔེར་ན་སྦྲང་བུས་རྒྱ་མཚོ་ཆེན་པོའི་ཆབ་འཚལ་བ་དང་འདྲ་ཡང་བསོད་ནམས་དེའི་དབང་གིས་སེམས་ཅན་ཐམས་ཅད་འཁོར་བ་གཏན་དུ་སྤངས་ནས་བླ་ན་མ་མཆིས་པའི་ལམ་མངོན་པར་གྲུབ་པར་སྨོན་ཏོ།
en: Nevertheless, I pray that through the power of its merit all beings will completely abandon saṃsāra and accomplish the highest path.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་མོ་སྤོབས་པ་ཆེན་མོ་ལ་བཀའ་སྩལ་པ། ཁྱོད་ཀྱིས་ཡུན་རིང་པོ་ནས་བསྒོམས་པས་སྤོབས་པ་ཆེན་པོ་དང་ལྡན་པར་གྱུར་ནས།
en: Then the Bhagavat said to the great goddess Sarasvatī, “You have obtained this great eloquence through having meditated for a long time.

source: དེང་ངའི་ཡོན་ཏན་རྒྱ་ཆེར་བསྔགས་པ་བརྗོད་པ་ལེགས་སོ་ལེགས་སོ།
en: Your extensive praise of my qualities today is excellent, excellent!

source: །འདིའི་དབང་གིས་ཁྱོད་མྱུར་དུ་བླ་ན་མེད་པའི་ཆོས་ཀྱི་སྒོ་མོ་མངོན་པར་རྟོགས་ནས་མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཏེ། ཐམས་ཅད་ལ་རྒྱ་ཆེར་ཕན་འདོགས་པར་འགྱུར་རོ།
en: Through its power you will quickly realize the gateway of the highest Dharma, have a perfection of the signs and features of a great being, and be of vast benefit to all.

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་ལྷ་མོ་སྤོབས་པ་ཆེན་མོས་བསྔགས་པ་བརྗོད་པའི་ལེའུ་སྟེ་སུམ་ཅུ་པའོ།། །།དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཚད་མེད་པ་སྙེད་རྣམས་དང་།
en: This concludes “The Praise by the Great Goddess Sarasvatī,” the thirtieth chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: ལྷ་དང་། མི་རྣམས་དང་། འཁོར་མང་པོ་ཐམས་ཅད་ལ་བཀའ་སྩལ་པ། ཁྱེད་ཀྱིས་འདི་ལྟར་རིག་པར་བྱ་སྟེ། ངས་བསྐལ་པ་ཆེན་པོ་ཚད་མེད་གྲངས་མེད་པ་ནས་ནན་ཏན་བརྩོན་འགྲུས་ཀྱིས་དཀའ་བ་སྤྱད་དེ་ཐོབ་པའི་ཆོས་ཤིན་ཏུ་ཟབ་པ་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཡང་དག་པ་གང་ཡིན་པ་དེ་ནི་ཁྱེད་ལ་ཡང་དག་པར་བསྟན་ཟིན་ན།
en: Chapter 31: The Entrustment Then the Bhagavat said to the entire assembly of all the bodhisattvas and the devas and humans, “You should know this: I have taught you the true cause of enlightenment, the extremely profound Dharma that I obtained through undergoing hardships with dedicated diligence throughout countless, innumerable eons. “

source: ཁྱེད་ཅག་ལས་སུ་ཞིག་རབ་ཏུ་བརྟུལ་བའི་སེམས་བསྐྱེད་ནས་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གུས་པས་ཡོངས་སུ་བསྲུངས་ནས་རྒྱ་ཆེར་ཡང་དག་པར་སྤེལ་ཏེ། ཡང་དག་པའི་ཆོས་འཇིག་རྟེན་ན་ཡུན་རིང་དུ་གནས་པར་བྱེད།
en: You should develop a courageous mind, and after my nirvāṇa you should, with veneration, protect this Dharma teaching, promulgate it widely, and ensure that this Dharma will remain for a long time.”

source: དེ་ནས་འཁོར་མང་པོའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་དང་། ལྷའི་འཁོར་ཕལ་མང་པོ་བྱེ་བ་ཕྲག་དྲུག་ཅུས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས། བཅོམ་ལྡན་འདས་བདག་ཅག་ཐམས་ཅད་ལ་ཡང་མོས་པའི་སེམས་མཆིས་པས་བཅོམ་ལྡན་འདས་ཀྱིས་བསྐལ་པ་ཆེན་པོ་ཚད་མ་མཆིས་པ་ནས་ནན་ཏན་བརྩོན་འགྲུས་ཀྱིས་དཀའ་བ་མཛད་དེ། བརྙེས་པའི་ཆོས་ཤིན་ཏུ་ཟབ་པ་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཡང་དག་པ་གང་ལགས་པ་དེ་ལ་གུས་པས་ཡོངས་སུ་བསྲུངས་ནས།
en: Then from among that great assembly, six hundred million great bodhisattvas and the assembled multitude of six hundred million devas said in one voice, “Bhagavat, all of us have that motivation of aspiration, so that we will, with veneration, protect the true cause of enlightenment, the extremely profound Dharma that you attained through undergoing hardships with dedicated diligence throughout countless, innumerable eons.

source: བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སླད་ན་ཡང་ལུས་དང་སྲོག་ལ་ཕངས་པ་མ་མཆིས་པར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྒྱ་ཆེར་སྤེལ་ཏེ། ཡང་དག་པའི་ཆོས་འཇིག་རྟེན་ན་ཡུན་རིང་དུ་གནས་པར་བགྱིད་དོ་ཞེས་གསོལ་ཏོ།
en: Bhagavat, after your nirvāṇa, without any care for our bodies and lives, we will promulgate this Dharma teaching widely, so that the true Dharma will remain in the world for a long time.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། བཅོམ་ལྡན་ཡང་དག་བདེན་ཚིག་གསུང་། །ཡང་དག་ཆོས་ལ་རབ་ཏུ་བཞུགས། །ཡང་དག་བདེན་པ་དེ་དབང་གིས། །མདོ་སྡེ་འདི་ནི་སྲུང་འཛིན་བགྱིད།
en: Those bodhisattvas mahāsattvas then recited these verses in the presence of the Bhagavat: “Bhagavat, you speak the words of genuine truth; You have entered completely into the true Dharma— Through the power of that genuine truth, We will protect and keep this sūtra. “

source: །ཐུགས་རྗེ་ཆེན་པོའི་གོ་མནབས་ནས། །ཐུགས་རྗེ་ཆེ་ལ་རབ་ཏུ་བཞུགས།
en: You wear the armor of great compassion, And you remain within great compassion.

source: །བྱམས་དང་ཐུགས་རྗེ་དེ་སྟོབས་ཀྱིས། །མདོ་སྡེ་འདི་ནི་སྲུང་འཛིན་བགྱིད།
en: Through the power of your love and compassion, We will protect and keep this sūtra. “

source: །བསོད་ནམས་ཚོགས་ནི་ཡོངས་རྫོགས་ནས། །ཡེ་ཤེས་ཚོགས་ནི་རབ་ཏུ་བསྐྱེད། །ཚོགས་རྣམས་ཡོངས་སུ་རྫོགས་པའི་སླད། །མདོ་སྡེ་འདི་ནི་སྲུང་འཛིན་བགྱིད།
en: You have completed the accumulation of merit, And you have given rise to the accumulation of wisdom— In order to complete the accumulations, We will protect and keep this sūtra. “

source: །བདུད་རྣམས་ཐམས་ཅད་རབ་བརྟུལ་ཏེ།
en: You have subjugated all the Māras.

source: །ལོག་སྨྲ་ཐམས་ཅད་རྣམ་པར་བཤིག །
en: You have destroyed all false teachings.

source: ངན་ལྟ་ཐམས་ཅད་བསལ་བའི་སླད། །མདོ་སྡེ་འདི་ནི་སྲུང་འཛིན་བགྱིད།
en: In order to dispel all evil views, We will protect and keep this sūtra. “

source: །འཇིག་རྟེན་སྐྱོང་དང་བརྒྱ་བྱིན་དང་། །ཚངས་པ་དང་ནི་ལྷ་མ་ཡིན། །ཀླུ་དང་གནོད་སྦྱིན་ལ་སོགས་པས། །མདོ་སྡེ་འདི་ནི་སྲུང་འཛིན་བགྱིད།
en: The world protectors and Śakra, Brahmā, and the asuras, The nāgas, yakṣas, and so on Will protect and keep this sūtra. “

source: །ས་ཡི་སྟེང་དང་མཁའ་གནས་པ། །ཡུན་རིང་འདིར་ནི་གནས་པ་རྣམས། །བཅོམ་ལྡན་བསྟན་པ་འཛིན་བགྱིད་པ། །མདོ་སྡེ་འདི་ནི་སྲུང་འཛིན་བགྱིད།
en: Those who dwell on the earth and in the sky, Those who dwell here for a long time, Those who hold the Bhagavat’s teaching Will protect and keep this sūtra. “

source: །ཚངས་པའི་བཞུགས་བཞི་མཚུངས་ལྡན་ཞིང་། །འཕགས་བདེན་བཞི་ཡིས་རབ་བརྒྱན་ནས།
en: In accordance with the four brahmavihāras, The Bhagavat is adorned by the four noble truths.

source: །བདུད་བཞི་དག་ནི་ཕམ་མཛད་སླད། །མདོ་སྡེ་འདི་ནི་སྲུང་འཛིན་བགྱིད།
en: Because he subdued the four māras, We will protect and keep this sūtra. “

source: །ནམ་མཁའ་ཐོགས་བཅས་འགྱུར་ཡང་སྲིད།
en: It is possible that space may become solid.

source: །ཐོགས་བཅས་ནམ་མཁར་འགྱུར་སྲིད་ཀྱི།
en: It is possible that the solid will become space.

source: །སངས་རྒྱས་རྣམས་ཀྱིས་བསྲུངས་བཟུང་བ། །སུས་ཀྱང་བསྒུལ་ཞིང་བསྐྱོད་མི་འགྱུར།
en: But that which is held and protected by the buddhas Cannot be shaken or unsettled by anyone.”

source: །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བཅོམ་ལྡན་འདས་ཀྱིས་དམ་པའི་ཆོས་འདི་བསྲུང་བ་བཀས་བཤད་པ་ཐོས་པ་དང་། སོ་སོ་ནས་རྗེས་སུ་ཡི་རང་བའི་སེམས་བསྐྱེད་ནས་ཡང་དག་པའི་ཆོས་ཡོངས་སུ་བསྲུང་བའི་སེམས་ཀྱིས་ཅིག་ཅར་མགྲིན་གཅིག་ཏུ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། བདག་ཅག་མདོ་སྡེ་འདི་ལ་ནི། །བུ་དང་བུ་མོ་འཁོར་དང་བཅས། །ཐམས་ཅད་རྩེ་གཅིག་རབ་བསྲུངས་ནས།
en: Then the Four Mahārājas, having heard the Bhagavat teach that this Dharma should be protected, all gave rise to rejoicing in their minds, and with the motivation to completely protect the true Dharma, they recited these verses in one voice: “We and all our retinues of sons and daughters Will single-mindedly, Perfectly protect this sūtra And promulgate it widely. “

source: །རྒྱ་ཆེར་ཡང་དག་སྤེལ་བར་བགྱིད། །གང་ཞིག་མདོ་འདི་རབ་བཟུང་ནས། །བྱང་ཆུབ་རྒྱུ་ནི་སྒྲུབ་བགྱིད་ན། །བདག་ཅག་རྟག་པར་ཕྱོགས་བཞི་ནས། །སྲུང་སྐྱོབ་རིམ་གྲོ་དག་ཀྱང་བགྱིད།
en: We will constantly, from all four directions, Protect and defend and serve those Who are in possession of this sūtra And practice the cause of enlightenment.”

source: །དེ་ནས་བརྒྱ་བྱིན་ལྷའི་དབང་པོས་གུས་པས་ཐལ་མོ་སྦྱར་ནས་ཚིགས་སུ་བཅད་པ་གསོལ་པ། སངས་རྒྱས་ཆོས་ནི་ཐུགས་ཆུད་ནས། །དྲིན་ནི་བསབ་པར་བཞེད་པ་དང་། །བྱང་ཆུབ་སེམས་དཔའ་ཕན་གདགས་སླད། །འཇིག་རྟེན་འདས་ཀྱང་མདོ་སྡེ་གསུངས།
en: Then Śakra, the lord of devas, placed his palms together in veneration and spoke these verses: “The buddhas, having realized the Dharma, In order to repay that kindness And in order to benefit the bodhisattvas, Though they have transcended the world, teach the sūtras. “

source: །བདག་ཀྱང་སངས་རྒྱས་དེ་དག་ལ། །དྲིན་བསབ་སླད་དུ་རྟག་མཆོད་ནས། །འདི་འདྲའི་མདོ་སྡེ་འདི་དང་ནི། །མདོ་སྡེ་འདི་ལ་སྲུང་བར་བགྱིད།
en: I also, in order to repay their kindness, Constantly make offerings to the buddhas, And I will protect this sūtra And those sūtras similar to this.”

source: །དེ་ནས་དགའ་ལྡན་པའི་ལྷའི་བུ་རྣམས་ཀྱིས་གུས་པས་ཐལ་མོ་སྦྱར་ནས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། བཅོམ་ལྡན་གསུངས་པའི་མདོ་སྡེ་འདི། །གང་ཞིག་འཛིན་པར་བགྱིད་པ་ནི། །བྱང་ཆུབ་གནས་སྐབས་གནས་པས་ན། །དགའ་ལྡན་ལྷར་ནི་རབ་ཏུ་འགྱུར།
en: Then the Tuṣita devas placed their palms together in veneration and spoke these verses: “Whoever becomes a holder of This sūtra spoken by the Bhagavat Will dwell within a state of enlightenment And will become a Tuṣita deva. “

source: །བཅོམ་ལྡན་བདག་ཅག་རབ་དགའ་ནས། །ལྷ་ཡི་རྣམ་སྨིན་མཆོག་སྤངས་ནས། །འཛམ་གླིང་དག་ཏུ་གནས་ནས་ནི། །མདོ་སྡེ་འདི་ནི་སྒྲོགས་པར་བགྱིད།
en: Bhagavat, with utmost joy we abandon The perfectly ripened result of paradise— We will dwell in Jambudvīpa, And we will proclaim this sūtra.”

source: །དེ་ནས་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བདག་པོ་ཚངས་པ་ལྷའི་རྒྱལ་པོས། གུས་པས་ཐལ་མོ་སྦྱར་ནས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། བསམ་གཏན་རྣམས་དང་ཐེག་རྣམས་དང་། །རྣམ་ཐར་ཚད་མེད་ཐམས་ཅད་ཀྱང་། །མདོ་སྡེ་འདི་ལས་བྱུང་བས་ན།
en: Then Brahmā, the lord of the Sahā world realm, the king of devas, placed his palms together in veneration and spoke these verses: “All the dhyānas and the yānas, And all the countless liberations, All arise from this sūtra, And therefore I will teach this sūtra. “

source: །དེ་སླད་མདོ་འདི་རབ་ཏུ་གསུངས། །མདོ་སྡེ་འདི་ནི་སྟོན་པའི་གནས། །ཚངས་པའི་བདེ་བ་བདག་སྤངས་ནས།
en: I have abandoned the pleasures of Brahmā For the places where this sūtra is taught.

source: །མདོ་སྡེ་འདི་ནི་མཉན་པའི་སླད། །རྟག་པར་ཡོངས་སུ་སྲུང་སྐྱོབ་བགྱིད།
en: In order to listen to this sūtra, I will always protect and defend it.”

source: །དེ་ནས་བདུད་ཀྱི་རྒྱལ་པོའི་བུ་ཚོང་དཔོན་ཞེས་བྱ་བས་ཡང་གུས་པས་ཐལ་མོ་སྦྱར་ནས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། ཡང་དག་དོན་དང་ལྡན་པའི་མདོ། །བདུད་སྤྱོད་རྗེས་སུ་མི་འབྲང་ཞིང་། །བདུད་ཀྱི་ལས་ངན་སྦྱོང་བགྱིད་པ། །འདི་ནི་གང་ཞིག་འཛིན་བགྱིད་ན།
en: Then, Śreṣṭhin, the son of the lord of Māras, placed his palms together in veneration and spoke these verses: “Whoever is a holder of this sūtra, Which possesses the true meaning, Does not follow the conduct of the Māras And purifies the bad actions of the Māras. “

source: །བདག་ཀྱང་མདོ་སྡེ་འདི་ལ་ནི། །བརྩོན་པ་དག་གིས་རབ་བསྲུངས་ནས། །བརྩོན་འགྲུས་ཆེན་པོའི་སེམས་བསྐྱེད་དེ། །ཀུན་དུ་རྒྱ་ཆེར་སྤེལ་བར་བགྱིད།
en: For those who are dedicated to this sūtra, I too will give complete protection, And I will develop great diligence And promulgate it widely everywhere.”
